/**
  * @brief	裝甲資料
  * @author	colin1124x@gmail.com
  * @date	2011/11/28
 */
(function(namespace){
	var main = namespace.Armor = function()
	{
		
	}
	main.data = {
		'﻿隱密' : {name : '﻿隱密 / Stealth ', rune : [7,5], type : '有二個凹槽的盔甲 2 Socket Armor', 
		property : ['法術傷害減少 3','+6 敏捷','+15 耐久上限','毒素抗性 +30%','法力重生 15%','25% 高速跑步/行走','25% 高速施法','25% 快速再度攻擊']},
		'煙霧' : {name : '煙霧 / Smoke ', rune : [4,17], type : '有二個凹槽的盔甲 2 Socket Armor', 
		property : ['+75% 增加防禦','+280 對飛射性武器防禦','所有抗性+50%','20% 快速再度攻擊','等級 6 削弱 (18 聚氣)','+10 精力','-1 照亮範圍']},
		'慎重 ' : {name : '慎重  / Prudence ', rune : [23,3], type : '有二個凹槽的盔甲 2 Socket Armor', 
		property : ['25% 快速再度攻擊','+140-170%增強防禦 (變動)','全面抵抗+25-35 (變動)','物理傷害減少 3','魔法傷害減少 17','+2 法力在每殺死一名敵人之後取得','+2 照亮範圍回復耐久度1於4秒內']},
		'獅子心' : {name : '獅子心 / Lionheart ', rune : [15,17,19], type : '有三個凹槽的盔甲 3 Socket Armor', 
		property : ['+20% 增強傷害','需求 -15%','+25 力量','+10 精力','+20 體力','+15 敏捷','+50 生命','所有抗性+30%']},
		'財富' : {name : '財富 / Wealth ', rune : [20,18,3], type : '有三個凹槽的盔甲 3 Socket Armor', 
		property : ['300% 額外金錢從敵人身上取得','100% 更加機率取得魔法物品','+2 法力在每殺死一名敵人之後取得','+10 敏捷']},
		'強制' : {name : '強制 / Duress ', rune : [13,22,10], type : '有三個凹槽的盔甲 3 Socket Armor', 
		property : ['40% 快速打擊恢復','+10-20% 增強傷害 (變動)','+37-133 冰冷傷害','15% 機會出現壓碎性打擊','33% 機會撕裂傷口','+150-200% 增強禦力 (變動)','-20% 減慢體力耗損','抗冰 +45%','抗電 +15%','抗火 +15%','抗毒 +15%']},
		'幽暗' : {name : '幽暗 / Gloom ', rune : [19,22,21], type : '有三個凹槽的盔甲 3 Socket Armor', 
		property : ['被擊中時有15% 機會施展等級 3 微暗靈視','+10% 快速再度攻擊','170-230% 增強防禦 (變動)','+10 力量','所有抗性 +45','冰凍時間減半','5% 傷害移至法力','-3 到照亮範圍']},
		'謎團' : {name : '謎團 / Enigma ', rune : [31,6,30], type : '有三個凹槽的盔甲 3 Socket Armor', 
		property : ['+2 到所有技能','45% 高速跑步/行走','+1 傳送','+750-775 防禦 (變動)','+0-74 力量 (依角色等級乘0.75)','增加最大生命 5%','傷害減少 8%','+14 生命在每殺一個敵人後取得','15% 傷害移至法力','+1-99% 更佳機會取得魔法裝備 (依角色等級乘1)']},
		'石塊' : {name : '石塊 / Stone ', rune : [13,22,21,17], type : '有四個凹槽的盔甲 4 Socket Armor', 
		property : ['60% 快速再度攻擊','+250-290% 增強防禦 (變動)','+300 對飛射性武器的防禦','+16 力量','+16 體力','+10 精力','所有抗性 +15','等級 16 溶漿巨岩 (80 聚氣)','等級 16 黏土石魔 (16 聚氣)']},
		'野薔薇' : {name : '野薔薇 / Bramble ', rune : [8,27,29,5], type : '有四個凹槽的盔甲 4 Socket Armor', 
		property : ['等級15-21刺針靈氣賦予 (變動)','+50% 快速再度攻擊','+25-50% 到毒素技能傷害 (變動)','+300 防禦','增加最大法力 5%','法力重生 15%','+5% 到最大冰冷抵抗','抗火 +30%','抗毒 +100%','+13 生命在每殺一個敵人後取得','等級 13 棘靈 (33 聚氣)']},
		'榮耀之鍊' : {name : '榮耀之鍊 / Chains of Honor ', rune : [14,22,30,24], type : '有四個凹槽的盔甲 4 Socket Armor', 
		property : ['+2 到所有技能','+200% 對惡魔系生物傷害','+100% 對不死系生物傷害','8% 生命于擊中時偷取','70% 增強防禦','+20 力量','生命恢復速度 +7','所有抗性 +65','傷害減少 8%','25% 更佳機會取得魔法裝備']},
		'背信' : {name : '背信 / Treachery ', rune : [13,10,20], type : '有三個凹槽的盔甲 3 Socket Armor', 
		property : ['攻擊時有 5% 機會施展等級 15 能量消解','打擊時有 25% 機會施展等級 15 毒牙','+2 刺客技能','+45% 增加準確率','+20% 快速再度攻擊','抗寒 +30%','50% 額外金幣從怪物身上取得']},
		'降雨' : {name : '降雨 / Rain ', rune : [9,23,6], type : '有三個凹槽的盔甲 3 Socket Armor', 
		property : ['攻擊時有 5% 機會施展等級 15 颶風裝甲','打擊時有 5% 機會施展等級 15 謙鼬風','+2 德魯依技能','+100-150 法力(變動)','抗電 +30%','法術傷害減少 7','15% 受損的生命移至法力']},
		'教化' : {name : '教化 / Enlightenment ', rune : [21,8,12], type : '有三個凹槽的盔甲 3 Socket Armor', 
		property : ['攻擊時有 5% 機會施展等級 15 炙烈之徑','打擊時有 5% 機會施展等級 15 火球','+2 法師技能','+1致 暖氣','+30% 防禦強化','抗火 +30%','傷害減少 7']},
		'白骨' : {name : '白骨 / Bone ', rune : [12,22,22], type : '有三個凹槽的盔甲 3 Socket Armor', 
		property : ['攻擊時有 5% 機會施展等級 15 白骨裝甲','打擊時有 25% 機會施展等級 15 骨矛','+2 死靈法師技能','+100-150 法力(變動)','所有抗性 +30','傷害減少 7']},
		'原理' : {name : '原理 / Principle ', rune : [8,25,2], type : '有三個凹槽的盔甲 3 Socket Armor', 
		property : ['打擊時有 100% 機會施展等級 5 聖光彈','+2 聖騎士技能','15% 減緩精力消耗','+5% 最大毒素抵抗','抗火 +30%']},
		'和平' : {name : '和平 / Peace ', rune : [13,10,11], type : '有三個凹槽的盔甲 3 Socket Armor', 
		property : ['攻擊時有 4% 機會施展等級 5 慢速箭','打擊時有 2% 機會施展等級 15 女武神','+2 亞馬遜技能','+20% 快速再度攻擊','+2致 致命攻擊','抗寒 +30%','攻擊者受到傷害 14']},
		'神話' : {name : '神話 / Myth ', rune : [15,11,4], type : '有三個凹槽的盔甲 3 Socket Armor', 
		property : ['攻擊時有 3% 機會施展等級 1 狂嗥','打擊時有 10% 機會施展等級 1 嘲弄','+2 野蠻人技能','+30 對飛射性防禦','生命補滿 +10','攻擊者受到傷害 14','需求 -15%']},
		'飛龍 ' : {name : '飛龍  / Dragon ※天梯專用', rune : [29,28,12], type : '有三個凹槽的盔甲 3 Socket Body Armor', 
		property : ['打擊時20%機率產生18級的毒牙','攻擊時12%機率產生15級九頭火蛇','等級14聖火靈氣賦予','+360 防禦 增強防禦修改為"防禦"','+230 對飛射性武器防禦','+3-5 所有屬性 (變動)','+0-37 力量 (依角色等級乘0.375)','增加最大法力上限 5%','+5%最大閃電抗性','傷害減少7']},
		'剛毅 ' : {name : '剛毅  / Fortitude ※天梯專用', rune : [1,12,14,28], type : '有四個凹槽的盔甲 4 Socket Body Armor', 
		property : ['攻擊時20%機率產生15級寒冰裝甲','25%高速施法速度增加','300%傷害','增加200%防禦','+15防禦','+1-148生命 (依角色等級乘1-1.5) (變動)','生命補滿+7','+5%最大閃電抗性','所有抗性 +25-30 (變動)','減少傷害7','12% 傷害轉為法力','+1照亮範圍']}
	}
})(self.diablo2 = self.diablo2 || {});