/**
  * @brief	頭盔資料
  * @author	colin1124x@gmail.com
  * @date	2011/11/28
 */
(function(namespace){
	var main = namespace.Helmet = function()
	{
		
	}
	main.data = {
		'﻿天底' : {name : '﻿天底 / Nadir ', rune : [4,3], type : '有二個凹槽的頭盔2 Socket Helms', 
		property : ['+50% 防禦強化','+10 防禦','+30 對飛射性武器防禦','等級13 魔影斗篷 (9 聚氣)','+2 法力在每殺死一名敵人之後取得','+5 力量','-33% 額外金錢從敵人身上取得','-3 照亮範圍']},
		'知識' : {name : '知識 / Lore Ort ', rune : [9,12], type : '有二個凹槽的頭盔2 Socket Helms', 
		property : ['+1 所有技能等級','+10 精力','+2 法力在每殺死一名敵人之後取得','+30%閃電抗性傷害減少 7','+2 照亮範圍']},
		'光輝' : {name : '光輝 / Radiance ', rune : [4,12,6], type : '有三個凹槽的頭盔3 Socket Helms', 
		property : ['+75% 防禦強化','+30 對飛射性武器防禦','+10 精力','+10 體力','15% 受損的生命轉移至法力法術傷害減少 3','+33 法力傷害減少 7','+5 照亮範圍']},
		'迪勒瑞姆' : {name : '迪勒瑞姆 / Delirium ', rune : [20,24,16], type : '有三個凹槽的頭盔3 Socket Helms', 
		property : ['被擊中時有1% 機會施展等級 50 迪勒瑞姆','被擊中時有10% 機會施展等級 14 心靈爆震','被擊中時有20% 機會施展等級 13 恐懼','擊中敵人時有33% 機會施展等級 18 迷亂','+2 到所有技能','+261 防禦','+10 體力','50% 額外金幣從怪物身上取得','25% 更佳機會取得魔法裝備','等級 17 吸引 (60 聚氣)']},
		'夢境 ' : {name : '夢境  / Dream ※天梯專用', rune : [16,31,21], type : '有三個凹槽的頭盔 3 Socket Helms', 
		property : ['被打10%機率產生15等的迷亂','等級15神聖衝擊靈氣賦予','+20-30% 再度快速攻擊 (變動)','30%增強防禦','+150-220 防禦 (變動)','+10體力','增加最大血量5%','+0-61 法力 (依角色等級乘0.625)','所有抗性 +5-20 (變動)','12-25% 更佳取得法裝備 (變動)']}
	}
})(self.diablo2 = self.diablo2 || {});