/**
  * @brief	盾牌資料
  * @author	colin1124x@gmail.com
  * @date	2011/11/28
 */
(function(namespace){
	var main = namespace.Shield = function()
	{
		
	}
	main.data = {
		'﻿押韻' : {name : '﻿押韻 / Rhyme ', rune : [13,5], type : '有二個凹槽的盾牌2 Socket Shields', 
		property : ['20% 增加格擋率','40% 快速再度格擋','全面抵抗 +25%','法力重生 15%','無法冰凍','50% 額外金錢從敵人身上取得','25% 更佳的機會取得魔法物品']},
		'燦爛 ' : {name : '燦爛  / Splendor ', rune : [5,17], type : '有二個凹槽的盾牌2 Socket Shields', 
		property : ['+1 到所有技能','10% 高速施展','20% 快速格檔率','+60-100% 增強防禦 (變動)','+10 精力','法力重生15%','50% 額外金幣從怪物身上取得','20% 更佳機會取得魔法裝備','+3照亮範圍','提升裝備耐久度 12%']},
		'古代人的誓約' : {name : '古代人的誓約 / Ancient\'s Pledge ', rune : [8,9,7], type : '有三個凹槽的盾牌3 Socket Shields', 
		property : ['+50%防禦強化','+43%冰冷抗性','+48%火焰抗性','+48%閃電抗性','+48%毒素抗性','10%受損生命轉移至法力']},
		'聖堂' : {name : '聖堂 / Sanctuary ', rune : [18,18,23], type : '有三個凹槽的盾牌3 Socket Shields', 
		property : ['20% 快速再度攻擊','20% 快速格檔率','20% 增加格檔率','130-160% 增強防禦 (變動)','+250 對飛射性武器的防禦','+20 敏捷','所有抗性 +50-70 (變動)','魔法傷害減少 7','等級 12 慢速箭 (60 聚氣)']},
		'流亡' : {name : '流亡 / Exile ', rune : [26,27,24,14], type : '有四個凹槽的聖騎士專用盾牌4 Socket Paladin Shields', 
		property : ['擊中敵人時有15% 機會施展等級 5 偷取生命','等級 13-16 反抗靈氣賦予 (變動)','+2 到攻擊性靈氣 (限聖騎士)','+30% 快速格檔率','凍結目標','220-260% 增強防禦 (變動)','生命恢復速度 +7','+5% 到最大冰冷抵抗','+5% 到最大火焰抵抗','25% 更佳機會取得魔法裝備','回復耐久度1於4秒內']},
		'飛龍 ' : {name : '飛龍  / Dragon ※天梯專用', rune : [29,28,12], type : '有三個凹槽的盾牌 3 Socket Shields', 
		property : ['打擊時20%機率產生18級的毒牙','攻擊時12%機率產生15級九頭火蛇','等級14聖火靈氣賦予','+360 防禦 增強防禦修改為"防禦"','+230 對飛射性武器防禦','+3-5 所有屬性 (變動)','+0-37 力量 (依角色等級乘0.375)','+50 法力','+5%最大閃電抗性','傷害減少7']},
		'夢境 ' : {name : '夢境  / Dream ※天梯專用', rune : [16,31,21], type : '有三個凹槽的盾牌 3 Socket Shields', 
		property : ['被打10%機率產生15等的迷亂','直接賦予15等神聖衝擊靈氣','+20-30% 再度快速攻擊 (變動)','30%增強防禦+150-220 防禦 (變動)','+10體力','+50 生命','+0-61 法力 (依角色等級乘0.625)','所有抗性 +5-20 (變動)','12-25% 更佳取得法裝備 (變動)']},
		'精神 ' : {name : '精神  / Spirit ※天梯專用', rune : [7,10,9,11], type : '有四個凹槽的盾牌 4 Socket Shields', 
		property : ['+2 所有技能','+25%-35% 高速施展速度 (變動)','+55% 快速度再攻擊','+250 對飛射性防禦','+22 體力','+89-112 法力 (變動)','抗寒+35%','抗閃電+35%','抗毒+35%','+3-8 魔法吸收 (變動)','攻擊者受到傷害14']},
		'鳳凰 ' : {name : '鳳凰  / Phoenix ※天梯專用', rune : [26,26,28,31], type : '有四個凹槽的盾牌 4 Socket Shields', 
		property : ['100% 機率當你升級時施展等級40熾烈之徑','40% 打擊時施展等級22火風暴','等級 10-15 救贖靈氣賦予 (變動)','+350-400% 增強傷害 (變動)','-28%對敵人火焰系抗性','+350-400 對遠距防禦 (變動)','+50 生命','+5% 最大閃電抵抗','+10% 最大火焰抵抗','+15-21 火焰吸收 (變動)']}
	}
})(self.diablo2 = self.diablo2 || {});